app/controllers/api/contacts_controller.rb

    def index
        render :json => Contact.all
---
SELECT "contacts".* FROM "contacts"

    def create
        contact = Contact.new(contact_params)
        if contact.save
---
INSERT INTO "contacts" ("firstname", "lastname", "phone", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["firstname", "sfffsdf"], ["lastname", "sdfsdfs"], ["phone", "sfsdf"], ["email", "sfsdf"], ["created_at", "2019-06-15 17:59:23.542244"], ["updated_at", "2019-06-15 17:59:23.542244"]]