app/controllers/api/photos_controller.rb

    def index
        render :json => Photo.all
---
SELECT "photos".* FROM "photos"