app/controllers/api/quotes_controller.rb

SELECT "quotes".* FROM "quotes"
---
    def index
        render :json => Quote.all